def from_R_to_T(Rt):
	"""пересчет сопротивления термометра в температуру"""
	Rttb = 100.0268 										# коэф. сопротивления ТС в тройной точке воды
	A = -0.000142											# справочный коэфициент для альфа 0,00385 °С-1
	B = -0.0000435											# справочный коэф-нт для альфа 0,00385 °С-1
	Wt = Rt/Rttb
	dWt = A*(Wt-1)+B*(Wt-1)**2
	Wst = Wt-dWt
	D0=439.932854
	D = [472.418020,37.684494,7.472018,2.920828,0.005184,-0.963864,-0.188732,0.191203,0.049025]
	summa = 0
	for i,item in enumerate(D):
		j=i+1
		summa += D[i]*((Wst-2.64)/1.64)**j
	t = D0+summa
	print(t)
	return t

if __name__ == "__main__":
	from_R_to_T(139.3)
